<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="input_0" type="Parameter" version="opset1">
			<data shape="8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="8,1,1352,2040" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_5798" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_5799" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_5800" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_5801" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="//nncf_model_input_1|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="//nncf_model_input_1|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="in_conv.0.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 1, 3, 3" offset="8" size="432" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_6172" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_6109" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="440" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/in_conv/in_conv.0/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/in_conv/in_conv.0/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/in_conv/in_conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_102" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="632" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/in_conv/in_conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/in_conv/in_conv.0/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_130" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="824" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/in_conv/in_conv.1/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/in_conv/in_conv.1/LeakyRelu_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_5802" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="828" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_5803" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="832" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_5804" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="828" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_5805" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="832" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/in_conv/in_conv.1/Generator/Sequential[in_conv]/LeakyReLU[1]/leaky_relu_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/in_conv/in_conv.1/Generator/Sequential[in_conv]/LeakyReLU[1]/leaky_relu_0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="rlfb_qpa.RLFB1.0.c1_r.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 48, 3, 3" offset="836" size="20736" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Convert_6293" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_6230" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="21572" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/rlfb_qpa/RLFB1/RLFB1.0/c1_r/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c1_r/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/rlfb_qpa/RLFB1/RLFB1.0/c1_r/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_182" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="21764" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/rlfb_qpa/RLFB1/RLFB1.0/c1_r/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c1_r/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_210" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="21956" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/rlfb_qpa/RLFB1/RLFB1.0/act/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act/LeakyRelu_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_5806" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21960" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_5807" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21964" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_5808" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21960" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_5809" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21964" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="rlfb_qpa.RLFB1.0.c2_r.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 48, 3, 3" offset="21968" size="20736" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Convert_6414" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_6351" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="42704" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/rlfb_qpa/RLFB1/RLFB1.0/c2_r/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c2_r/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/rlfb_qpa/RLFB1/RLFB1.0/c2_r/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_238" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="42896" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/rlfb_qpa/RLFB1/RLFB1.0/c2_r/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c2_r/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_266" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="21956" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/rlfb_qpa/RLFB1/RLFB1.0/act_1/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act_1/LeakyRelu_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_5810" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="43088" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_5811" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="43092" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_5812" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="43088" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_5813" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="43092" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_1|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_1|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="rlfb_qpa.RLFB1.0.c3_r.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 48, 3, 3" offset="43096" size="20736" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Convert_6535" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_6472" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="63832" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/rlfb_qpa/RLFB1/RLFB1.0/c3_r/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c3_r/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/rlfb_qpa/RLFB1/RLFB1.0/c3_r/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_294" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="64024" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/rlfb_qpa/RLFB1/RLFB1.0/c3_r/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c3_r/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_322" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="21956" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/rlfb_qpa/RLFB1/RLFB1.0/act_2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act_2/LeakyRelu_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_5814" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64216" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_5815" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64220" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_5816" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64216" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_5817" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64220" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_2|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/act/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/LeakyReLU[act]/leaky_relu_2|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/rlfb_qpa/RLFB1/RLFB1.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/Add_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_5818" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64224" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_5819" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64228" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_5820" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64224" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_5821" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="64228" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/rlfb_qpa/RLFB1/RLFB1.0/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/__add___0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/__add___0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="rlfb_qpa.RLFB1.0.c5.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 48, 1, 1" offset="64232" size="2304" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Convert_6656" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_6593" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="66536" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/rlfb_qpa/RLFB1/RLFB1.0/c5/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c5/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/rlfb_qpa/RLFB1/RLFB1.0/c5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_354" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="66728" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/rlfb_qpa/RLFB1/RLFB1.0/c5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c5/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_5822" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="66920" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_5823" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="66924" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_5824" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="66920" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_5825" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="66924" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/rlfb_qpa/RLFB1/RLFB1.0/c5/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/NNCFConv2d[c5]/conv2d_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/RLFB1/RLFB1.0/c5/Generator/RLFB_QPA[rlfb_qpa]/Sequential[RLFB1]/RLFB[0]/NNCFConv2d[c5]/conv2d_0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_5826" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_5827" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="66928" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_5828" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_5829" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="66928" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="//nncf_model_input_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="//nncf_model_input_0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="66932" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_output_0">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="rlfb_qpa.liner_gamma.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 1" offset="66940" size="48" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Convert_6777" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_6714" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1" offset="66988" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/rlfb_qpa/liner_gamma/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/liner_gamma/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/rlfb_qpa/liner_gamma/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_5830" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48" offset="67180" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/rlfb_qpa/liner_gamma/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/liner_gamma/Gemm_output_0">
					<dim>8</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_5831" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="67372" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_5832" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="67376" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_5833" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="67372" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_5834" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="67376" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/rlfb_qpa/liner_gamma/Generator/RLFB_QPA[rlfb_qpa]/NNCFLinear[liner_gamma]/linear_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/rlfb_qpa/liner_gamma/Generator/RLFB_QPA[rlfb_qpa]/NNCFLinear[liner_gamma]/linear_0|OUTPUT/FakeQuantize_output_0">
					<dim>8</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/rlfb_qpa/qp_att1/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67380" size="8" />
			<output>
				<port id="0" precision="I64" names="/rlfb_qpa/qp_att1/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/rlfb_qpa/qp_att1/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/qp_att1/Unsqueeze_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/rlfb_qpa/qp_att1/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67380" size="8" />
			<output>
				<port id="0" precision="I64" names="/rlfb_qpa/qp_att1/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/rlfb_qpa/qp_att1/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/qp_att1/Unsqueeze_1_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="rlfb_qpa.qp_att1.res.weight" type="Const" version="opset1">
			<data element_type="i8" shape="48, 48, 3, 3" offset="67388" size="20736" />
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_6898" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_6835" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 1" offset="88124" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/rlfb_qpa/qp_att1/res/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/qp_att1/res/pre_ops.0/op/FakeQuantize_output_0">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/rlfb_qpa/qp_att1/res/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="88316" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/rlfb_qpa/qp_att1/res/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rlfb_qpa/qp_att1/res/Conv_output_0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_5835" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="88508" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_5836" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="88512" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_5837" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="88508" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_5838" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="88512" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/rlfb_qpa/qp_att1/res/Generator/RLFB_QPA[rlfb_qpa]/QPAttention[qp_att1]/NNCFConv2d[res]/conv2d_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1352</dim>
					<dim>2040</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
